---
kind: other
id: Methods.T:Autodesk.Revit.DB.Opening
source: html/aff6f4ae-ca24-51a1-8198-77c567e21f8d.htm
---
# Opening Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.